# -*- coding: utf-8 -*-
"""
Spyderエディタ

これは一時的なスクリプトファイルです。
20"""
import datetime
path = '\\Users\\61694\\.spyder-py3\\1.txt'
with open(path) as f:
    lines=f.readlines()
    #print(f.read())
#20201019133124,10.20.30.1/16,2
#20201019133224,10.20.30.1/16,522
#20201019133324,10.20.30.1/16,-
#20201019133125,10.20.30.2/16,1
#20201019133225,10.20.30.2/16,1
#20201019133325,10.20.30.2/16,2
#20201019133134,192.168.1.1/24,10
#20201019133234,192.168.1.1/24,8
#20201019133135,192.168.1.2/24,5
#20201019133235,192.168.1.2/24,15
    lines_strip=[line.strip()for line in lines]
    g1=[line for line in lines_strip if'-' in line]
    #print(g1)
    #['20201019133324,10.20.30.1/16,-']
    g2=[g1[0].split(',')]
    #print(g2[0])
   #['20201019133324', '10.20.30.1/16', '-']
   
g3=[s for s in g2[0] if '20201019'in s]
#print(g3)
#['20201019133324']
g4=str(g3[0])
dte=datetime.datetime.strptime(g4,'%Y%m%d%H%M%S')
print('故障時間は')
print(dte)
#故障時間は
#2020-10-19 13:33:24